
#ifndef __COMMONUSE_H
#define __COMMONUSE_H
#include "stm32f10x.h" 
/**********************************************************
* 函数功能 ---> BCD码转为HEX
* 入口参数 ---> BCD_Data：要转换的BCD数据
* 返回数值 ---> HEX码
* 功能说明 ---> none
**********************************************************/	
uint8_t BCD_to_HEX(uint8_t BCD_Data);
 
/**********************************************************
* 函数功能 ---> HEX码转为BCD
* 入口参数 ---> HEX_Data：要转换的BCD数据
* 返回数值 ---> BCD码
* 功能说明 ---> none
**********************************************************/	
uint8_t HEX_to_BCD(uint8_t HEX_Data);
 
/**********************************************************
* 函数功能 ---> 10进制码转为16进制
* 入口参数 ---> DX_Data：要转换的10进制数据
* 返回数值 ---> 16进制
* 功能说明 ---> none
**********************************************************/
uint16_t DX_to_HX(uint16_t DX_Data);
 
/**********************************************************
* 函数功能 ---> 16进制码转为10进制
* 入口参数 ---> HX_Data：要转换的16进制数据
* 返回数值 ---> 10进制
* 功能说明 ---> none
**********************************************************/
uint16_t HX_to_DX(uint16_t HX_Data);
int Search_SubArray(const uint8_t* src,uint16_t src_len,const uint8_t * search,uint16_t search_len);


#endif
